#final size:235
#det-ver:rsa-res-v3
#align-ver:affine-v1
#crop:110
#offsety:12
#batchsize:640
name: "IRv1"

mem_param {
  optimize_train: false
}
#----------------------------------------- start ----------------------------------------
input: "data"
input_dim: 1
input_dim: 3
input_dim: 235
input_dim: 235

input: "label"
input_dim: 1
input_dim: 1
input_dim: 1
input_dim: 1

layer {
  name: "stem.step1.3x3.1.conv"
  type: "Convolution"
  bottom: "data"
  top: "stem.step1.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "stem.step1.3x3.1.bn"
  type: "BN"
  bottom: "stem.step1.3x3.1.conv"
  top: "stem.step1.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step1.3x3.1.relu"
  type: "ReLU"
  bottom: "stem.step1.3x3.1"
  top: "stem.step1.3x3.1"
}
layer {
  name: "stem.step1.3x3.2.conv"
  type: "Convolution"
  bottom: "stem.step1.3x3.1"
  top: "stem.step1.3x3.2.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step1.3x3.2.bn"
  type: "BN"
  bottom: "stem.step1.3x3.2.conv"
  top: "stem.step1.3x3.2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step1.3x3.2.relu"
  type: "ReLU"
  bottom: "stem.step1.3x3.2"
  top: "stem.step1.3x3.2"
}
layer {
  name: "stem.step1.3x3.3.conv"
  type: "Convolution"
  bottom: "stem.step1.3x3.2"
  top: "stem.step1.3x3.3.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step1.3x3.3.bn"
  type: "BN"
  bottom: "stem.step1.3x3.3.conv"
  top: "stem.step1.3x3.3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step1.3x3.3.relu"
  type: "ReLU"
  bottom: "stem.step1.3x3.3"
  top: "stem.step1.3x3.3"
}
layer {
  name: "stem.step1.pool"
  type: "Pooling"
  bottom: "stem.step1.3x3.3"
  top: "stem.step1.pool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "stem.step1.3x3.conv"
  type: "Convolution"
  bottom: "stem.step1.3x3.3"
  top: "stem.step1.3x3.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "stem.step1.3x3.bn"
  type: "BN"
  bottom: "stem.step1.3x3.conv"
  top: "stem.step1.3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step1.3x3.relu"
  type: "ReLU"
  bottom: "stem.step1.3x3"
  top: "stem.step1.3x3"
}
layer {
  name: "stem.step1.concat"
  type: "Concat"
  bottom: "stem.step1.pool"
  bottom: "stem.step1.3x3"
  top: "stem.step1.concat"
}
layer {
  name: "stem.step2.short.1x1.conv"
  type: "Convolution"
  bottom: "stem.step1.concat"
  top: "stem.step2.short.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step2.short.1x1.bn"
  type: "BN"
  bottom: "stem.step2.short.1x1.conv"
  top: "stem.step2.short.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step2.short.1x1.relu"
  type: "ReLU"
  bottom: "stem.step2.short.1x1"
  top: "stem.step2.short.1x1"
}
layer {
  name: "stem.step2.short.3x3.conv"
  type: "Convolution"
  bottom: "stem.step2.short.1x1"
  top: "stem.step2.short.3x3.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step2.short.3x3.bn"
  type: "BN"
  bottom: "stem.step2.short.3x3.conv"
  top: "stem.step2.short.3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step2.short.3x3.relu"
  type: "ReLU"
  bottom: "stem.step2.short.3x3"
  top: "stem.step2.short.3x3"
}
layer {
  name: "stem.step2.long.1x1.conv"
  type: "Convolution"
  bottom: "stem.step1.concat"
  top: "stem.step2.long.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step2.long.1x1.bn"
  type: "BN"
  bottom: "stem.step2.long.1x1.conv"
  top: "stem.step2.long.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step2.long.1x1.relu"
  type: "ReLU"
  bottom: "stem.step2.long.1x1"
  top: "stem.step2.long.1x1"
}
layer {
  name: "stem.step2.long.1x7.conv"
  type: "Convolution"
  bottom: "stem.step2.long.1x1"
  top: "stem.step2.long.1x7.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step2.long.1x7.bn"
  type: "BN"
  bottom: "stem.step2.long.1x7.conv"
  top: "stem.step2.long.1x7"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step2.long.1x7.relu"
  type: "ReLU"
  bottom: "stem.step2.long.1x7"
  top: "stem.step2.long.1x7"
}
layer {
  name: "stem.step2.long.7x1.conv"
  type: "Convolution"
  bottom: "stem.step2.long.1x7"
  top: "stem.step2.long.7x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step2.long.7x1.bn"
  type: "BN"
  bottom: "stem.step2.long.7x1.conv"
  top: "stem.step2.long.7x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step2.long.7x1.relu"
  type: "ReLU"
  bottom: "stem.step2.long.7x1"
  top: "stem.step2.long.7x1"
}
layer {
  name: "stem.step2.long.3x3.conv"
  type: "Convolution"
  bottom: "stem.step2.long.7x1"
  top: "stem.step2.long.3x3.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "stem.step2.long.3x3.bn"
  type: "BN"
  bottom: "stem.step2.long.3x3.conv"
  top: "stem.step2.long.3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step2.long.3x3.relu"
  type: "ReLU"
  bottom: "stem.step2.long.3x3"
  top: "stem.step2.long.3x3"
}
layer {
  name: "stem.step2.concat"
  type: "Concat"
  bottom: "stem.step2.short.3x3"
  bottom: "stem.step2.long.3x3"
  top: "stem.step2.concat"
}
layer {
  name: "stem.step3.pool"
  type: "Pooling"
  bottom: "stem.step2.concat"
  top: "stem.step3.pool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "stem.step3.3x3.conv"
  type: "Convolution"
  bottom: "stem.step2.concat"
  top: "stem.step3.3x3.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "stem.step3.3x3.bn"
  type: "BN"
  bottom: "stem.step3.3x3.conv"
  top: "stem.step3.3x3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stem.step3.3x3.relu"
  type: "ReLU"
  bottom: "stem.step3.3x3"
  top: "stem.step3.3x3"
}
layer {
  name: "stem.step3.concat"
  type: "Concat"
  bottom: "stem.step3.pool"
  bottom: "stem.step3.3x3"
  top: "stem"
}
layer {
  name: "a1.way1.poly1.path1.1x1.conv"
  type: "Convolution"
  bottom: "stem"
  top: "a1.way1.poly1.path1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.path1.1x1.bn"
  type: "BN"
  bottom: "a1.way1.poly1.path1.1x1.conv"
  top: "a1.way1.poly1.path1.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.way1.poly1.path1.1x1.relu"
  type: "ReLU"
  bottom: "a1.way1.poly1.path1.1x1"
  top: "a1.way1.poly1.path1.1x1"
}
layer {
  name: "a1.way1.poly1.path1.3x3.1.conv"
  type: "Convolution"
  bottom: "a1.way1.poly1.path1.1x1"
  top: "a1.way1.poly1.path1.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.path1.3x3.1.bn"
  type: "BN"
  bottom: "a1.way1.poly1.path1.3x3.1.conv"
  top: "a1.way1.poly1.path1.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.way1.poly1.path1.3x3.1.relu"
  type: "ReLU"
  bottom: "a1.way1.poly1.path1.3x3.1"
  top: "a1.way1.poly1.path1.3x3.1"
}
layer {
  name: "a1.way1.poly1.path1.3x3.2.conv"
  type: "Convolution"
  bottom: "a1.way1.poly1.path1.3x3.1"
  top: "a1.way1.poly1.path1.3x3.2.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.path1.3x3.2.bn"
  type: "BN"
  bottom: "a1.way1.poly1.path1.3x3.2.conv"
  top: "a1.way1.poly1.path1.3x3.2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.way1.poly1.path1.3x3.2.relu"
  type: "ReLU"
  bottom: "a1.way1.poly1.path1.3x3.2"
  top: "a1.way1.poly1.path1.3x3.2"
}
layer {
  name: "a1.way1.poly1.path2.1x1.conv"
  type: "Convolution"
  bottom: "stem"
  top: "a1.way1.poly1.path2.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.path2.1x1.bn"
  type: "BN"
  bottom: "a1.way1.poly1.path2.1x1.conv"
  top: "a1.way1.poly1.path2.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.way1.poly1.path2.1x1.relu"
  type: "ReLU"
  bottom: "a1.way1.poly1.path2.1x1"
  top: "a1.way1.poly1.path2.1x1"
}
layer {
  name: "a1.way1.poly1.path2.3x3.1.conv"
  type: "Convolution"
  bottom: "a1.way1.poly1.path2.1x1"
  top: "a1.way1.poly1.path2.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.path2.3x3.1.bn"
  type: "BN"
  bottom: "a1.way1.poly1.path2.3x3.1.conv"
  top: "a1.way1.poly1.path2.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.way1.poly1.path2.3x3.1.relu"
  type: "ReLU"
  bottom: "a1.way1.poly1.path2.3x3.1"
  top: "a1.way1.poly1.path2.3x3.1"
}
layer {
  name: "a1.way1.poly1.path3.1x1.conv"
  type: "Convolution"
  bottom: "stem"
  top: "a1.way1.poly1.path3.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.path3.1x1.bn"
  type: "BN"
  bottom: "a1.way1.poly1.path3.1x1.conv"
  top: "a1.way1.poly1.path3.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.way1.poly1.path3.1x1.relu"
  type: "ReLU"
  bottom: "a1.way1.poly1.path3.1x1"
  top: "a1.way1.poly1.path3.1x1"
}
layer {
  name: "a1.way1.poly1.concat"
  type: "Concat"
  bottom: "a1.way1.poly1.path1.3x3.2"
  bottom: "a1.way1.poly1.path2.3x3.1"
  bottom: "a1.way1.poly1.path3.1x1"
  top: "a1.way1.poly1.concat"
}
layer {
  name: "a1.way1.poly1.1x1.conv"
  type: "Convolution"
  bottom: "a1.way1.poly1.concat"
  top: "a1.way1.poly1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a1.way1.poly1.1x1.bn"
  type: "BN"
  bottom: "a1.way1.poly1.1x1.conv"
  top: "a1.way1.poly1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a1.elt"
  type: "Eltwise"
  bottom: "stem"
  bottom: "a1.way1.poly1"
  top: "a1"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "a1.relu"
  type: "ReLU"
  bottom: "a1"
  top: "a1"
}
layer {
  name: "a2.way1.poly1.path1.1x1.conv"
  type: "Convolution"
  bottom: "a1"
  top: "a2.way1.poly1.path1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.path1.1x1.bn"
  type: "BN"
  bottom: "a2.way1.poly1.path1.1x1.conv"
  top: "a2.way1.poly1.path1.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.way1.poly1.path1.1x1.relu"
  type: "ReLU"
  bottom: "a2.way1.poly1.path1.1x1"
  top: "a2.way1.poly1.path1.1x1"
}
layer {
  name: "a2.way1.poly1.path1.3x3.1.conv"
  type: "Convolution"
  bottom: "a2.way1.poly1.path1.1x1"
  top: "a2.way1.poly1.path1.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.path1.3x3.1.bn"
  type: "BN"
  bottom: "a2.way1.poly1.path1.3x3.1.conv"
  top: "a2.way1.poly1.path1.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.way1.poly1.path1.3x3.1.relu"
  type: "ReLU"
  bottom: "a2.way1.poly1.path1.3x3.1"
  top: "a2.way1.poly1.path1.3x3.1"
}
layer {
  name: "a2.way1.poly1.path1.3x3.2.conv"
  type: "Convolution"
  bottom: "a2.way1.poly1.path1.3x3.1"
  top: "a2.way1.poly1.path1.3x3.2.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.path1.3x3.2.bn"
  type: "BN"
  bottom: "a2.way1.poly1.path1.3x3.2.conv"
  top: "a2.way1.poly1.path1.3x3.2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.way1.poly1.path1.3x3.2.relu"
  type: "ReLU"
  bottom: "a2.way1.poly1.path1.3x3.2"
  top: "a2.way1.poly1.path1.3x3.2"
}
layer {
  name: "a2.way1.poly1.path2.1x1.conv"
  type: "Convolution"
  bottom: "a1"
  top: "a2.way1.poly1.path2.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.path2.1x1.bn"
  type: "BN"
  bottom: "a2.way1.poly1.path2.1x1.conv"
  top: "a2.way1.poly1.path2.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.way1.poly1.path2.1x1.relu"
  type: "ReLU"
  bottom: "a2.way1.poly1.path2.1x1"
  top: "a2.way1.poly1.path2.1x1"
}
layer {
  name: "a2.way1.poly1.path2.3x3.1.conv"
  type: "Convolution"
  bottom: "a2.way1.poly1.path2.1x1"
  top: "a2.way1.poly1.path2.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.path2.3x3.1.bn"
  type: "BN"
  bottom: "a2.way1.poly1.path2.3x3.1.conv"
  top: "a2.way1.poly1.path2.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.way1.poly1.path2.3x3.1.relu"
  type: "ReLU"
  bottom: "a2.way1.poly1.path2.3x3.1"
  top: "a2.way1.poly1.path2.3x3.1"
}
layer {
  name: "a2.way1.poly1.path3.1x1.conv"
  type: "Convolution"
  bottom: "a1"
  top: "a2.way1.poly1.path3.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.path3.1x1.bn"
  type: "BN"
  bottom: "a2.way1.poly1.path3.1x1.conv"
  top: "a2.way1.poly1.path3.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.way1.poly1.path3.1x1.relu"
  type: "ReLU"
  bottom: "a2.way1.poly1.path3.1x1"
  top: "a2.way1.poly1.path3.1x1"
}
layer {
  name: "a2.way1.poly1.concat"
  type: "Concat"
  bottom: "a2.way1.poly1.path1.3x3.2"
  bottom: "a2.way1.poly1.path2.3x3.1"
  bottom: "a2.way1.poly1.path3.1x1"
  top: "a2.way1.poly1.concat"
}
layer {
  name: "a2.way1.poly1.1x1.conv"
  type: "Convolution"
  bottom: "a2.way1.poly1.concat"
  top: "a2.way1.poly1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a2.way1.poly1.1x1.bn"
  type: "BN"
  bottom: "a2.way1.poly1.1x1.conv"
  top: "a2.way1.poly1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a2.elt"
  type: "Eltwise"
  bottom: "a1"
  bottom: "a2.way1.poly1"
  top: "a2"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "a2.relu"
  type: "ReLU"
  bottom: "a2"
  top: "a2"
}
layer {
  name: "a3.way1.poly1.path1.1x1.conv"
  type: "Convolution"
  bottom: "a2"
  top: "a3.way1.poly1.path1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.path1.1x1.bn"
  type: "BN"
  bottom: "a3.way1.poly1.path1.1x1.conv"
  top: "a3.way1.poly1.path1.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.way1.poly1.path1.1x1.relu"
  type: "ReLU"
  bottom: "a3.way1.poly1.path1.1x1"
  top: "a3.way1.poly1.path1.1x1"
}
layer {
  name: "a3.way1.poly1.path1.3x3.1.conv"
  type: "Convolution"
  bottom: "a3.way1.poly1.path1.1x1"
  top: "a3.way1.poly1.path1.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.path1.3x3.1.bn"
  type: "BN"
  bottom: "a3.way1.poly1.path1.3x3.1.conv"
  top: "a3.way1.poly1.path1.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.way1.poly1.path1.3x3.1.relu"
  type: "ReLU"
  bottom: "a3.way1.poly1.path1.3x3.1"
  top: "a3.way1.poly1.path1.3x3.1"
}
layer {
  name: "a3.way1.poly1.path1.3x3.2.conv"
  type: "Convolution"
  bottom: "a3.way1.poly1.path1.3x3.1"
  top: "a3.way1.poly1.path1.3x3.2.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.path1.3x3.2.bn"
  type: "BN"
  bottom: "a3.way1.poly1.path1.3x3.2.conv"
  top: "a3.way1.poly1.path1.3x3.2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.way1.poly1.path1.3x3.2.relu"
  type: "ReLU"
  bottom: "a3.way1.poly1.path1.3x3.2"
  top: "a3.way1.poly1.path1.3x3.2"
}
layer {
  name: "a3.way1.poly1.path2.1x1.conv"
  type: "Convolution"
  bottom: "a2"
  top: "a3.way1.poly1.path2.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.path2.1x1.bn"
  type: "BN"
  bottom: "a3.way1.poly1.path2.1x1.conv"
  top: "a3.way1.poly1.path2.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.way1.poly1.path2.1x1.relu"
  type: "ReLU"
  bottom: "a3.way1.poly1.path2.1x1"
  top: "a3.way1.poly1.path2.1x1"
}
layer {
  name: "a3.way1.poly1.path2.3x3.1.conv"
  type: "Convolution"
  bottom: "a3.way1.poly1.path2.1x1"
  top: "a3.way1.poly1.path2.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.path2.3x3.1.bn"
  type: "BN"
  bottom: "a3.way1.poly1.path2.3x3.1.conv"
  top: "a3.way1.poly1.path2.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.way1.poly1.path2.3x3.1.relu"
  type: "ReLU"
  bottom: "a3.way1.poly1.path2.3x3.1"
  top: "a3.way1.poly1.path2.3x3.1"
}
layer {
  name: "a3.way1.poly1.path3.1x1.conv"
  type: "Convolution"
  bottom: "a2"
  top: "a3.way1.poly1.path3.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.path3.1x1.bn"
  type: "BN"
  bottom: "a3.way1.poly1.path3.1x1.conv"
  top: "a3.way1.poly1.path3.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.way1.poly1.path3.1x1.relu"
  type: "ReLU"
  bottom: "a3.way1.poly1.path3.1x1"
  top: "a3.way1.poly1.path3.1x1"
}
layer {
  name: "a3.way1.poly1.concat"
  type: "Concat"
  bottom: "a3.way1.poly1.path1.3x3.2"
  bottom: "a3.way1.poly1.path2.3x3.1"
  bottom: "a3.way1.poly1.path3.1x1"
  top: "a3.way1.poly1.concat"
}
layer {
  name: "a3.way1.poly1.1x1.conv"
  type: "Convolution"
  bottom: "a3.way1.poly1.concat"
  top: "a3.way1.poly1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a3.way1.poly1.1x1.bn"
  type: "BN"
  bottom: "a3.way1.poly1.1x1.conv"
  top: "a3.way1.poly1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a3.elt"
  type: "Eltwise"
  bottom: "a2"
  bottom: "a3.way1.poly1"
  top: "a3"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "a3.relu"
  type: "ReLU"
  bottom: "a3"
  top: "a3"
}
layer {
  name: "a4.way1.poly1.path1.1x1.conv"
  type: "Convolution"
  bottom: "a3"
  top: "a4.way1.poly1.path1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.path1.1x1.bn"
  type: "BN"
  bottom: "a4.way1.poly1.path1.1x1.conv"
  top: "a4.way1.poly1.path1.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.way1.poly1.path1.1x1.relu"
  type: "ReLU"
  bottom: "a4.way1.poly1.path1.1x1"
  top: "a4.way1.poly1.path1.1x1"
}
layer {
  name: "a4.way1.poly1.path1.3x3.1.conv"
  type: "Convolution"
  bottom: "a4.way1.poly1.path1.1x1"
  top: "a4.way1.poly1.path1.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.path1.3x3.1.bn"
  type: "BN"
  bottom: "a4.way1.poly1.path1.3x3.1.conv"
  top: "a4.way1.poly1.path1.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.way1.poly1.path1.3x3.1.relu"
  type: "ReLU"
  bottom: "a4.way1.poly1.path1.3x3.1"
  top: "a4.way1.poly1.path1.3x3.1"
}
layer {
  name: "a4.way1.poly1.path1.3x3.2.conv"
  type: "Convolution"
  bottom: "a4.way1.poly1.path1.3x3.1"
  top: "a4.way1.poly1.path1.3x3.2.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.path1.3x3.2.bn"
  type: "BN"
  bottom: "a4.way1.poly1.path1.3x3.2.conv"
  top: "a4.way1.poly1.path1.3x3.2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.way1.poly1.path1.3x3.2.relu"
  type: "ReLU"
  bottom: "a4.way1.poly1.path1.3x3.2"
  top: "a4.way1.poly1.path1.3x3.2"
}
layer {
  name: "a4.way1.poly1.path2.1x1.conv"
  type: "Convolution"
  bottom: "a3"
  top: "a4.way1.poly1.path2.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.path2.1x1.bn"
  type: "BN"
  bottom: "a4.way1.poly1.path2.1x1.conv"
  top: "a4.way1.poly1.path2.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.way1.poly1.path2.1x1.relu"
  type: "ReLU"
  bottom: "a4.way1.poly1.path2.1x1"
  top: "a4.way1.poly1.path2.1x1"
}
layer {
  name: "a4.way1.poly1.path2.3x3.1.conv"
  type: "Convolution"
  bottom: "a4.way1.poly1.path2.1x1"
  top: "a4.way1.poly1.path2.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.path2.3x3.1.bn"
  type: "BN"
  bottom: "a4.way1.poly1.path2.3x3.1.conv"
  top: "a4.way1.poly1.path2.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.way1.poly1.path2.3x3.1.relu"
  type: "ReLU"
  bottom: "a4.way1.poly1.path2.3x3.1"
  top: "a4.way1.poly1.path2.3x3.1"
}
layer {
  name: "a4.way1.poly1.path3.1x1.conv"
  type: "Convolution"
  bottom: "a3"
  top: "a4.way1.poly1.path3.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.path3.1x1.bn"
  type: "BN"
  bottom: "a4.way1.poly1.path3.1x1.conv"
  top: "a4.way1.poly1.path3.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.way1.poly1.path3.1x1.relu"
  type: "ReLU"
  bottom: "a4.way1.poly1.path3.1x1"
  top: "a4.way1.poly1.path3.1x1"
}
layer {
  name: "a4.way1.poly1.concat"
  type: "Concat"
  bottom: "a4.way1.poly1.path1.3x3.2"
  bottom: "a4.way1.poly1.path2.3x3.1"
  bottom: "a4.way1.poly1.path3.1x1"
  top: "a4.way1.poly1.concat"
}
layer {
  name: "a4.way1.poly1.1x1.conv"
  type: "Convolution"
  bottom: "a4.way1.poly1.concat"
  top: "a4.way1.poly1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a4.way1.poly1.1x1.bn"
  type: "BN"
  bottom: "a4.way1.poly1.1x1.conv"
  top: "a4.way1.poly1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a4.elt"
  type: "Eltwise"
  bottom: "a3"
  bottom: "a4.way1.poly1"
  top: "a4"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "a4.relu"
  type: "ReLU"
  bottom: "a4"
  top: "a4"
}
layer {
  name: "a5.way1.poly1.path1.1x1.conv"
  type: "Convolution"
  bottom: "a4"
  top: "a5.way1.poly1.path1.1x1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a5.way1.poly1.path1.1x1.bn"
  type: "BN"
  bottom: "a5.way1.poly1.path1.1x1.conv"
  top: "a5.way1.poly1.path1.1x1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a5.way1.poly1.path1.1x1.relu"
  type: "ReLU"
  bottom: "a5.way1.poly1.path1.1x1"
  top: "a5.way1.poly1.path1.1x1"
}
layer {
  name: "a5.way1.poly1.path1.3x3.1.conv"
  type: "Convolution"
  bottom: "a5.way1.poly1.path1.1x1"
  top: "a5.way1.poly1.path1.3x3.1.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a5.way1.poly1.path1.3x3.1.bn"
  type: "BN"
  bottom: "a5.way1.poly1.path1.3x3.1.conv"
  top: "a5.way1.poly1.path1.3x3.1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a5.way1.poly1.path1.3x3.1.relu"
  type: "ReLU"
  bottom: "a5.way1.poly1.path1.3x3.1"
  top: "a5.way1.poly1.path1.3x3.1"
}
layer {
  name: "a5.way1.poly1.path1.3x3.2.conv"
  type: "Convolution"
  bottom: "a5.way1.poly1.path1.3x3.1"
  top: "a5.way1.poly1.path1.3x3.2.conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "a5.way1.poly1.path1.3x3.2.bn"
  type: "BN"
  bottom: "a5.way1.poly1.path1.3x3.2.conv"
  top: "a5.way1.poly1.path1.3x3.2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  bn_param {
    sync_forward: false
    moving_average: true
    decay: 0.99
    scale_filler {
      type: "constant"
      value: 1.0
    }
    shift_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "a5.way1.poly1.path1.3x3.2.relu"
  type: "ReLU"
  bottom: "a5.way1.poly1.path1.3x3.2"
  top: "a5.way1.poly1.path1.3x3.2"
}
layer {
  name: "a5.way1.poly1.path2.1x1.conv"
  type: "Convolution"
  bottom: "a4"
  top: "a5.way1.poly1.path2.1x1.conv"
  param {
